html/dwm.html
<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Installation </h2>
<div class="outline-text-2" id="text-1">

<p>I've followed the instructions on <a href="https://bitbucket.org/djpohly/dwm-patches/src">dwm patches</a> then the instructions
on the README. I had to make a ~.hgrc 
</p>
<p>
Just changed the make line to run <code>make dwm</code> instead of
<code>make install</code> and copied resulting dwm library to ~/bin. Should have
symbolically linked it.
</p>
<p>
I have not even remembered to do "apt-get build-dep dwm" before
compiling, but it seems everything was already here.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">References </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1">Gentoo wiki page on dwm </h3>
<div class="outline-text-3" id="text-2_1">

<p>Useful tips to customize dwm bar.
<a href="http://en.gentoo-wiki.com/wiki/Dwm">http://en.gentoo-wiki.com/wiki/Dwm</a>
</p></div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2">X key reference </h3>
<div class="outline-text-3" id="text-2_2">

<p>All X key names are defined here:
<a href="http://cgit.freedesktop.org/xorg/proto/x11proto/plain/keysymdef.h1">http://cgit.freedesktop.org/xorg/proto/x11proto/plain/keysymdef.h1</a>
</p></div>
</div>
</div>
